app/views/quests/new.html.erb

SELECT "journeys".* FROM "journeys" ORDER BY "journeys"."name" ASC
---
  <%= f.label :journey, 'Journey', class: "form-label" %>
  <%= f.collection_select :journey_id, Journey.order(:name), :id, :name %>