app/views/students/show.html.erb

SELECT "quests".* FROM "quests" WHERE "quests"."journey_id" = $1  [["journey_id", 1]]
---
<ul>
  <% @journey.quests.each do |quest| %>