app/controllers/api/v1/assignments_controller.rb

      def show
        assignment = Assignment.find_by(student_id: params[:student_id], quest_id: params[:quest_id])
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."student_id" = $1 AND "assignments"."quest_id" = $2 LIMIT $3  [["student_id", 1], ["quest_id", 1], ["LIMIT", 1]]