app/controllers/api/v1/journeys_controller.rb

SELECT "journeys".* FROM "journeys" WHERE "journeys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        journey = Journey.find(params[:id])