app/controllers/api/v1/quests_controller.rb

      def index
        journey = Journey.find(params[:journey_id])
---
SELECT "journeys".* FROM "journeys" WHERE "journeys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

      def show
        journey = Journey.find(params[:journey_id])

        render json: QuestSerializer.new(journey.quests.find_by(id: params[:id]))
---
SELECT "journeys".* FROM "journeys" WHERE "journeys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "quests".* FROM "quests" WHERE "quests"."journey_id" = $1 AND "quests"."id" = $2 LIMIT $3  [["journey_id", 1], ["id", 1], ["LIMIT", 1]]