app/controllers/assignments_controller.rb

  def create
    Assignment.create!(params.merge(submitted_at: Time.current).require(:assignment).permit!)
---
INSERT INTO "assignments" ("submission", "submitted_at", "approved", "created_at", "updated_at", "quest_id", "student_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"