app/controllers/journeys_controller.rb

SELECT "journeys".* FROM "journeys" WHERE "journeys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @journey = Journey.find(params[:id])

SELECT "journeys".* FROM "journeys" ORDER BY "journeys"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def new
    @journeys = Journey.all

INSERT INTO "journeys" ("name", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My"], ["active", false], ["created_at", "2023-06-03 01:02:44.614980"], ["updated_at", "2023-06-03 01:02:44.614980"]]
---
  def create
    Journey.create!(params.require(:journey).permit!)