app/controllers/paths_controller.rb

INSERT INTO "paths" ("student_id", "journey_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 1], ["journey_id", 1], ["created_at", "2023-06-05 01:05:57.671682"], ["updated_at", "2023-06-05 01:05:57.671682"]]
---
  def create
    Path.create!(params.require(:path).permit!)