app/controllers/profiles_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @student = Student.find(params[:student_id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @student = Student.find(params[:student_id])

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "profiles" ("character", "stats", "created_at", "updated_at", "student_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    student = Student.find(params[:student_id])

    Profile.create!(params.require(:profile).permit!)