app/controllers/quests_controller.rb

SELECT "quests".* FROM "quests" WHERE "quests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."quest_id" = $1 AND "assignments"."student_id" = $2 ORDER BY "assignments"."id" ASC LIMIT $3  [["quest_id", 1], ["student_id", 1], ["LIMIT", 1]]
---
  def show
    @quest = Quest.find(params[:id])
    @student = Student.find(params[:student_id])
    @assignment = Assignment.where(quest: @quest, student: @student).first_or_initialize

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "journeys".* FROM "journeys" INNER JOIN "paths" ON "journeys"."id" = "paths"."journey_id" WHERE "paths"."student_id" = $1 ORDER BY "journeys"."id" ASC LIMIT $2  [["student_id", 1], ["LIMIT", 1]]
---
  def index
    @student = Student.find(params[:student_id])
    @journey = @student.journeys.first

SELECT "quests".* FROM "quests"
---
  def new
    @quests = Quest.all

INSERT INTO "quests" ("name", "story", "task", "created_at", "updated_at", "journey_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Quest"], ["story", nil], ["task", nil], ["created_at", "2023-06-04 23:04:06.796057"], ["updated_at", "2023-06-04 23:04:06.796057"], ["journey_id", 1]]
---
  def create
    Quest.create!(params.require(:quest).permit!)