app/controllers/students_controller.rb

SELECT "journeys".* FROM "journeys" WHERE "journeys"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @journey = Journey.find(params[:journey_id])
    @student = Student.find(params[:id])