app/views/journeys/show.html.erb

SELECT "students".* FROM "students" INNER JOIN "paths" ON "students"."id" = "paths"."student_id" WHERE "paths"."journey_id" = $1  [["journey_id", 1]]
---
<ul>
  <% @journey.students.each do |student| %>

SELECT "students".* FROM "students" ORDER BY "students"."name" ASC
---
  <%= f.label :student, 'Student', class: "form-label" %>
  <%= f.collection_select :student_id, Student.order(:name), :id, :name %>